# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
#MOBILENET
nc: 3  # number of classes
scales:
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 129 layers, 3,157,200 parameters, 8.9 GFLOPS
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 129 layers, 11,166,560 parameters, 28.8 GFLOPS
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 169 layers, 25,902,640 parameters, 79.3 GFLOPS
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 209 layers, 43,691,520 parameters, 165.7 GFLOPS
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 209 layers, 68,229,648 parameters, 258.5 GFLOPS

# Backbone replaced with MobileNet_v2 from TorchVision.
# We structure the backbone as a 10-layer list so that the original head’s skip connections remain valid:
# • Layer 4 (index 4) will provide the high-resolution (P3) feature: MobileNet_v2 layer 4 ([1, 32, 80, 80])
# • Layer 6 (index 6) will provide the medium-resolution (P4) feature: MobileNet_v2 layer 13 ([1, 96, 40, 40])
# • Layer 9 (index 9) will provide the low-resolution (P5) feature: MobileNet_v2 layer 18 ([1, 1280, 20, 20])
backbone:

  - [-1, 1, TorchVision, [1280, "mobilenet_v2", "DEFAULT", True, 1, True]]

  - [0, 1, nn.Identity, []]
  - [0, 1, nn.Identity, []]
  - [0, 1, nn.Identity, []]

  - [0, 1, Index, [32, 5]]

  - [4, 1, nn.Identity, []]

  - [0, 1, Index, [96, 14]]

  - [6, 1, nn.Identity, []]
  - [6, 1, nn.Identity, []]

  - [0, 1, Index, [1280, 19]]

# Head (retained unchanged from the original YOLOv8)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]]  # (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]]  # (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]
