# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv8 model with shufflenet_v2_x1_0 backbone restructured to provide correct feature indices
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

#SHUFFLENETV2
nc: 3  # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # Layer 0: Load shufflenet_v2_x1_0 from TorchVision with split=True.
  - [-1, 1, TorchVision, [1024, "shufflenet_v2_x1_0", "DEFAULT", True, 1, True]]
  # Layers 1-2: Pass through the TorchVision module’s output (a list of feature maps)
  - [0, 1, nn.Identity, []]
  - [0, 1, nn.Identity, []]
  # Layer 3: Extract the 80×80 feature (116 channels) from the TorchVision output list.
  - [0, 1, Index, [116, 5]]
  # Layer 4: Pass that extracted tensor along (P3 is now at index 4).
  - [3, 1, nn.Identity, []]
  # Layer 5: Extract the 40×40 feature (232 channels) from the TorchVision output list.
  - [0, 1, Index, [232, 6]]
  # Layer 6: Pass that extracted tensor along (P4 is now at index 6).
  - [5, 1, nn.Identity, []]
  # Layer 7: Extract the 20×20 feature (1024 channels) from the TorchVision output list.
  - [0, 1, Index, [1024, 8]]
  # Layer 8: Pass that extracted tensor along.
  - [7, 1, nn.Identity, []]
  # Layer 9: Final Identity to slot the P5 feature (now at index 9).
  - [8, 1, nn.Identity, []]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]       # Concatenate backbone output at index 6 (P4)
  - [-1, 3, C2f, [512]]              # (P4/16-medium)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]       # Concatenate backbone output at index 4 (P3)
  - [-1, 3, C2f, [256]]             # (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]      # Concatenate head P4
  - [-1, 3, C2f, [512]]             # (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]       # Concatenate backbone output at index 9 (P5)
  - [-1, 3, C2f, [1024]]            # (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]] # Detection layer: uses P3, P4, P5
